ajaxify_your_site/app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 19 Jul 2013 08:49:44 UTC +00:00], ["name", "first"], ["price", 1], ["updated_at", Fri, 19 Jul 2013 08:49:44 UTC +00:00]]
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save